//-------------------------------------------------------------------------------------------------
// File : TgaUtil.h
// Desc : Tga Utility.
// Copyright(c) Project Asura. All right reserved.
//-------------------------------------------------------------------------------------------------

#ifndef __TGA_UTIL_H__
#define __TGA_UTIL_H__

//-------------------------------------------------------------------------------------------------
// Includes
//-------------------------------------------------------------------------------------------------
#include <d3d11.h>
#include <asdxTexture.h>


//-------------------------------------------------------------------------------------------------
//! @brief      TGAファイルからテクスチャを生成します.
//!
//! @param[in]      filename        ファイル名です.
//! @param[out]     result          生成データ格納先.
//! @retval true    生成に成功.
//! @retval false   生成に失敗.
//-------------------------------------------------------------------------------------------------
bool CreateTextureFromTga( 
    ID3D11Device* pDevice, 
    ID3D11DeviceContext* pDeviceContext,
    const char16* filename,
    asdx::Texture2D& result ); 



#endif//__TGA_UTIL_H__
